BaseConfiguration/Money_2_0/Catalogs/СтатьиРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтатьиРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличественныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПропускатьВводКомментария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКомментарийПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/СтатистикаСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаСправочников</Name>
			<Comment>Вспомогательная информация для использования в отборах</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНеактуальных</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоАктуальных</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПомеченных</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВалют</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСвободных</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДляНакоплений</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКредиток</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоБезналичных</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаличных</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВзатыхДолгов</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыданныхДолгов</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Имущество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/СтатьиРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет информационные реквизиты по указанной или всем статьям
//	в регистре сведений "СтатистикаСправочников".
//Перед использованием необходимо актуализировать ключи статей.
//
//Параметры:
//	Ссылка - СправочникСсылка или Неопределено 
//
Процедура ОбновитьРегистрСтатистики(Ссылка = Неопределено) Экспорт
	
	РегистрыСведений.СтатистикаСправочников.ОбновитьСтатистикуСправочника("СтатьиРасходов", Ссылка);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПредопределенныеЭлементы();
	
	УзлыОбмена = ПланыОбмена.МобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.СтатьиРасходов);
	КонецЕсли;
	
	УзлыОбмена = ПланыОбмена.СинхронизацияАвтономныхКопий.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.СтатьиРасходов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПредопределенныеЭлементы() Экспорт
	
	Прочие = ПроверитьПредопределенный("ПрочиеРасходы", НСтр("ru='Прочие расходы'"), "Прочие расходы", Неопределено);
	ПроверитьПредопределенный("ИзменениеОстатка", НСтр("ru='Уменьшение остатка'"), "Изменение остатка", Прочие);
	ПроверитьПредопределенный("ОбменВалюты", НСтр("ru='Расход валюты'"), "Обмен валюты", Прочие);
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	ОбслуживаниеСправочников.ПроверитьСтандартныеПараметрыОтбора(Параметры);
	
	// Если в параметрах есть необходимые ключи/значения будет выполнена расширенная обработка получения данных
	ОбслуживаниеСправочников.ВыполнитьРасширенноеПолучениеДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда 
		
		ОбслуживаниеСправочников.ОбработкаПолученияФормыВыбора(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПроверитьПредопределенный(ИмяПредопределенного, Наименование1, Наименование2, РодительскаяСтатья) 
	
	Попытка
		Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтатьиРасходов." + ИмяПредопределенного);
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Ссылка = Справочники.СтатьиРасходов.НайтиПоНаименованию(Наименование1, Истина);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ссылка) И Наименование1 <> Наименование2 Тогда
		Ссылка = Справочники.СтатьиРасходов.НайтиПоНаименованию(Наименование2, Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка)
		Или Ссылка.Наименование <> Наименование1
		Или Ссылка.ИмяПредопределенныхДанных <> ИмяПредопределенного
		Или Не Ссылка.Активность
		Или Ссылка.Родитель <> РодительскаяСтатья Тогда
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			СпрОбъект = Ссылка.ПолучитьОбъект();
		Иначе
			СпрОбъект = Справочники.СтатьиРасходов.СоздатьЭлемент();
			СпрОбъект.Заполнить(Неопределено);
		КонецЕсли;
		
		СпрОбъект.ИмяПредопределенныхДанных = ИмяПредопределенного;
		СпрОбъект.Наименование = Наименование1;
		СпрОбъект.Родитель = РодительскаяСтатья;
		СпрОбъект.Активность = Истина;
		
		СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверятьСостояние", Истина);
		СпрОбъект.Записать();
		Ссылка = СпрОбъект.Ссылка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПометкаУдаления Тогда
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь, Истина);
	КонецЕсли;
	
	ОбслуживаниеСправочников.ПроверитьДублиНаименованийПредопределенного(Ссылка);
	
	Возврат Ссылка;
	
КонецФункции



#КонецОбласти


#КонецЕсли
